Revit 2027 API
TransactionGroup(Document) Constructor
 Constructs a transaction group object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionGroup(
	Document document
)
Public Sub New (
	document As Document
)
public:
TransactionGroup(
	Document^ document
)
new :
        document : Document -> TransactionGroup
Parameters
document Document
 The document for which this transaction group is being used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The group does not start until its Start method is called.
See Also
Reference
TransactionGroup Class
TransactionGroup Overload
Autodesk.Revit.DB Namespace